#+TITLE:   MonitorBench Performance Measurements
#+AUTHOR:  Foivos S. Zakkak
#+EMAIL:   foivos@zakkak.net
#+STARTUP: hidestars
#+STARTUP: showall
#+LaTeX_HEADER: \usepackage{pdflscape}

* MonitorBench

  Creates N threads where each thread tries to acquire a lock 100
  times and do something (a simple for loop iterating
  /artificial_work/ times).

** Content on same lock

*** From a single core 100*N times
    |--------------+----------------------|
    | # Iterations | Total time (ms)      |
    |--------------+----------------------|
    |            1 | 3496                 |
    |           15 | 34720                |
    |          255 | (144876+1wa) 574372  |
    |          503 | (263975+2wa) 1122967 |
    |--------------+----------------------|
    #   |   255 |     32 |              350462 | (186831+1wa) 616327 |
    #   |   503 |     63 | (261301+1wa) 690797 | (20484+4wa) 1738468 |
    [fn:1]
  
*** Measurements on monitor manager queuing impact on performance

    In the following tables and plots Throughput is expressed as
    Monitor Enter per second.

**** With MMGR queuing 
***** 100 locks per task 0 artificial work (includes join)
      #+CAPTION: Measurements with queueing on the MMGR
      #+tblname: manager-queue-total
      |-------+--------+-----------------+------------|
      | Tasks | Boards | Total time (ms) | Throughput |
      |-------+--------+-----------------+------------|
      |     1 |      1 |            3496 |      28.60 |
      |    15 |      2 |           21843 |      68.67 |
      |   255 |     32 |          350462 |      72.76 |
      |   503 |     63 |          690797 |      72.81 |
      |-------+--------+-----------------+------------|
      #+TBLFM: $4=($1*100)/($3/1000);%.2f
      #   |   503 |     63 | (261301+1wa) 690797 |

***** Polling every 1000th lock request 0 artificial work
      #+LATEX: \begin{landscape}
      #+ATTR_LaTeX: :environment longtable
      #+CAPTION: Measurements with queueing on the MMGR
      #+tblname: manager-queue
      |-------+--------+--------------+-------------+--------------+-----------+-----------+--------------+------------|
      | Tasks | Boards | mean (ticks) |      median |           q1 |       min |       max |           q3 | Throughput |
      |-------+--------+--------------+-------------+--------------+-----------+-----------+--------------+------------|
      |     1 |      1 | 221948800.25 |   221949169 |    221948236 | 221946077 | 221950188 | 221949832.75 |      45.06 |
      |    15 |      2 | 125692804.69 |   125341972 |    125090490 | 124518646 | 127070425 |    126493187 |      79.56 |
      |    63 |      8 | 125821675.25 | 125876486.5 |  125666035.5 | 125479629 | 126054099 | 126032126.25 |      79.48 |
      |   127 |     16 |  127020676.6 |   127124226 | 126496339.25 | 126101832 | 128066090 | 127315388.75 |      78.73 |
      |   255 |     32 | 126779867.29 |   126657053 | 126498700.25 | 126282656 | 127350633 | 127152188.75 |      78.88 |
      |   503 |     63 | 126524523.66 |   126693024 |  126397175.5 |  85615584 | 168552086 |  126820601.5 |      79.04 |
      |-------+--------+--------------+-------------+--------------+-----------+-----------+--------------+------------|
      #+TBLFM: $9=1000/($3/10000/1000);%.2f
      #+LATEX: \end{landscape}

**** Without MMGR queuing 

***** 100 locks per task 0 artificial work (includes join)
      #+CAPTION: Measurements without queueing on the MMGR
      #+tblname: manager-noqueue-total
      |-------+--------+-----------------+------------|
      | Tasks | Boards | Total time (ms) | Throughput |
      |-------+--------+-----------------+------------|
      |     1 |      1 |            3497 |      28.60 |
      |    15 |      2 |           31631 |      47.42 |
      |   255 |     32 |          616327 |      41.37 |
      |   503 |     63 |         1738468 |      28.93 |
      |-------+--------+-----------------+------------|
      #+TBLFM: $4=($1*100)/($3/1000);%.2f
      #   |   255 |     32 | (186831+1wa) 616327 |
      #   |   503 |     63 | (20484+4wa) 1738468 |
      [fn:1]

      #+begin_src gnuplot :var noqueuet=manager-noqueue-total :var queuet=manager-queue-total :exports results :file mmgr_noqueue_total.pdf
        set term pdf size 3,3
        set xlabel "Number of Java threads"
        set ylabel "Total execution time (sec)\n for 100 monitor enter/exit pairs"
        set style data histogram
        set style histogram cluster gap 1
        set boxwidth .85
        plot queuet using ($3/1000):xtic(1), \
             noqueuet using ($3/1000):xtic(1)
      #+end_src

      #+CAPTION: Impact of queuing on performance
      #+RESULTS:
      [[file:mmgr_noqueue_total.pdf]]

***** Polling every 1000th lock request 0 artificial work
      #+LATEX: \begin{landscape}
      #+ATTR_LaTeX: :environment longtable
      #+CAPTION: Measurements without queueing on the MMGR
      #+tblname: manager-noqueue
      |-------+--------+--------------+-------------+--------------+-----------+-----------+--------------+------------|
      | Tasks | Boards | mean (ticks) |      median |           q1 |       min |       max |           q3 | Throughput |
      |-------+--------+--------------+-------------+--------------+-----------+-----------+--------------+------------|
      |     1 |      1 | 222461846.62 | 222461223.5 | 222460686.75 | 222456404 | 222466702 | 222463839.75 |      44.95 |
      |    15 |      2 | 145210459.69 |   145730822 |    145725675 | 140771214 | 145876594 |    145731715 |      68.87 |
      |    63 |      8 |    142142525 |   142931995 |    141827982 | 139438002 | 143268108 |    143246538 |      70.35 |
      |   127 |     16 |  177922741.6 |   179111431 |  178914511.5 | 171436039 | 179612058 |    179280005 |      56.20 |
      |   255 |     32 |    228242294 |   243897349 |  223083533.5 | 154294314 | 245809965 |    243904867 |      43.81 |
      |   503 |     63 | 338780819.34 |   366808894 |    325460594 | 201488968 | 369774804 |  366824696.5 |      29.52 |
      |-------+--------+--------------+-------------+--------------+-----------+-----------+--------------+------------|
      #+TBLFM: $2=($1+8)/8;%d::$9=1000/($3/10000/1000);%.2f
      #+LATEX: \end{landscape}

      #+begin_src gnuplot :var queue=manager-queue :var noqueue=manager-noqueue :exports results :file mmgr_queue.pdf
        set xlabel "Number of Java threads"
        set ylabel "Throughput (Monitor Enters/sec)"
        set key inside bottom left vertical
        set xrange[0:512]
        #set logscale x 2
        plot queue using 1:9 title "With queuing" with linespoints, \
             noqueue using 1:9 title "Without queuing" with linespoints
        unset xrange
        unset logscale x
      #+end_src

      #+CAPTION: Impact of queuing on Throughput
      #+RESULTS:
      [[file:mmgr_queue.pdf]]

** Content on different locks
*** artificial_work = 0 (full contention)
**** Measurements from tasks with 1 monitor managers TODO re-take numbers
     #+tblname: single-manager
     |---------+--------+------------+--------+------+------+-------+-------|
     | # Tasks | Boards |  mean (ms) | median |   q1 |  min |   max |    q3 |
     |---------+--------+------------+--------+------+------+-------+-------|
     |       1 |      1 |       2166 |   2166 | 2166 | 2166 |  2166 |  2166 |
     |     255 |     32 |  2167.1803 |   2167 | 2167 | 2166 |  2169 |  2168 |
     |     287 |     36 |  2368.4146 |   2368 | 2367 | 2361 |  2373 |  2370 |
     |     319 |     40 |  2611.6896 |   2612 | 2610 | 2597 |  2618 |  2614 |
     |     383 |     48 |  4948.2950 |   4968 | 4911 | 4793 |  5037 |  4981 |
     |     503 |     63 | 10462.1391 |  10300 | 9823 | 8861 | 12108 | 11134 |
     |---------+--------+------------+--------+------+------+-------+-------|
     #    | 15  (2 boards)  |  2166.6666 |   2167 | 2166 | 2166 |  2168 |  2167 |  2 |
     #    | 271 (34 boards) |  2247.3874 |   2247 | 2246 | 2242 |  2252 |  2249 | 34 |

     #+begin_src gnuplot :var data=single-manager :exports results :file single_mmgr.pdf
       set style data linespoints
       set xlabel "Number of boards"
       set ylabel "Total execution time (ms per core)\n for 100 monitor enter/exit pairs"
       set xrange[0:512]
       set yrange[0:12500]
       set boxwidth .25 relativey
       unset key
       plot data using 1:4, \
            data using 1:5:6:7:8 with candlesticks whiskerbars, \
            data using 1:4:4:4:4 with candlesticks lt -1
       unset xrange
       unset yrange
     #+end_src

     #+CAPTION: Acquisition of different locks\n with a single manager
     #+RESULTS:
     [[file:single_mmgr.pdf]]

     From files: [[file:MonitorBench_mmgrs1_d1tasks_stats.log][1 task]], [[file:MonitorBench_mmgrs_d31tasks_stats.log][31 tasks]], [[file:MonitorBench_mmgrs_d63tasks_stats.log][63 tasks]], [[file:MonitorBench_mmgrs_d127tasks_stats.log][127 tasks]], [[file:MonitorBench_mmgrs_d191tasks_stats.log][191 tasks]],
     [[file:MonitorBench_mmgrs_d207tasks_stats.log][207 tasks]], [[file:MonitorBench_mmgrs_d223tasks_stats.log][223 tasks]], [[file:MonitorBench_mmgrs_d239tasks_stats.log][239 tasks]], [[file:MonitorBench_mmgrs_d241tasks_stats.log][241 tasks]], [[file:MonitorBench_mmgrs_d242tasks_stats.log][242 tasks]], [[file:MonitorBench_mmgrs_d243tasks_stats.log][243 tasks]],
     [[file:MonitorBench_mmgrs_d244tasks_stats.log][244 tasks]], [[file:MonitorBench_mmgrs_d245tasks_stats.log][245 tasks]], [[file:MonitorBench_mmgrs_d247tasks_stats.log][247 tasks]], [[file:MonitorBench_mmgrs_d255tasks_stats.log][255 tasks]], [[file:MonitorBench_mmgrs_d271tasks_stats.log][271 tasks]], [[file:MonitorBench_mmgrs_d300tasks_stats.log][300 tasks]],
     [[file:MonitorBench_mmgrs_d327tasks_stats.log][327 tasks]], [[file:MonitorBench_mmgrs_d344tasks_stats.log][344 tasks]], [[file:MonitorBench_mmgrs_d359tasks_stats.log][359 tasks]], [[file:MonitorBench_mmgrs_d360tasks_stats.log][360 tasks]], [[file:MonitorBench_mmgrs_d362tasks_stats.log][362 tasks]], [[file:MonitorBench_mmgrs_d364tasks_stats.log][364 tasks]],
     [[file:MonitorBench_mmgrs_d365tasks_stats.log][365 tasks]], [[file:MonitorBench_mmgrs_d366tasks_stats.log][366 tasks]], [[file:MonitorBench_mmgrs_d368tasks_stats.log][368 tasks]], [[file:MonitorBench_mmgrs_d376tasks_stats.log][376 tasks]], [[file:MonitorBench_mmgrs_d383tasks_stats.log][383 tasks]], [[file:MonitorBench_mmgrs_d399tasks_stats.log][399 tasks]],
     [[file:MonitorBench_mmgrs_d407tasks_stats.log][407 tasks]], [[file:MonitorBench_mmgrs_d408tasks_stats.log][408 tasks]], [[file:MonitorBench_mmgrs_d409tasks_stats.log][409 tasks]], [[file:MonitorBench_mmgrs_d411tasks_stats.log][411 tasks]], [[file:MonitorBench_mmgrs_d415tasks_stats.log][415 tasks]], [[file:MonitorBench_mmgrs_d439tasks_stats.log][439 tasks]],
     [[file:MonitorBench_mmgrs_d479tasks_stats.log][479 tasks]], [[file:MonitorBench_mmgrs_d481tasks_stats.log][481 tasks]], [[file:MonitorBench_mmgrs_d482tasks_stats.log][482 tasks]], [[file:MonitorBench_mmgrs_d483tasks_stats.log][483 tasks]], [[file:MonitorBench_mmgrs_d487tasks_stats.log][487 tasks]], [[file:MonitorBench_mmgrs_d495tasks_stats.log][495 tasks]],
     [[file:MonitorBench_mmgrs_d503tasks_stats.log][503 tasks]]

     #+LATEX: \begin{landscape}
     #+ATTR_LaTeX: :environment longtable
     #+tblname: throughput
     |---------+----------+----------+--------------+-----------+------------+-----------+-----------+------------+--------------------|
     | # Tasks | # Boards | Requests | mean (ticks) |    median |         q1 |       min |       max |         q3 | Throughput (Req/s) |
     |---------+----------+----------+--------------+-----------+------------+-----------+-----------+------------+--------------------|
     |       1 |        1 |     1000 | 216025506.66 | 216025665 |  216025128 | 216023373 | 216026643 |  216026238 |              46.29 |
     |      31 |        4 |     1000 |   6958626.75 |   6957136 |    6949437 |   6940932 |   7025813 |    6963209 |            1437.07 |
     |      63 |        8 |     1000 |   3419190.45 |   3419877 |    3413147 |   3401311 |   3493645 |    3423313 |            2924.67 |
     |     127 |       16 |     1000 |   1688379.09 |   1688481 |    1687153 |   1682243 |   1693848 |    1690099 |            5922.84 |
     |     191 |       24 |     1000 |   1119810.58 |   1119264 |    1118676 |   1116644 |   1124651 |    1121146 |            8930.08 |
     |     207 |       26 |     1000 |   1033000.44 |   1033123 |    1031116 |   1028870 |   1036366 |    1034709 |            9680.54 |
     |     223 |       28 |     1000 |    958660.30 |  958315.5 |   957289.5 |    953728 |    962527 |     960068 |           10431.22 |
     |     239 |       30 |     1000 |    893561.70 |  893418.5 |  892618.75 |    891721 |    896182 |     894276 |           11191.17 |
     |     241 |       31 |     1000 |    886069.50 |    885739 |  885405.75 |    884347 |    888907 |     886633 |           11285.80 |
     |     242 |       31 |     1000 |    884126.55 |    884071 |   883556.5 |    882887 |    885329 |   884644.5 |           11310.60 |
     |     243 |       31 |     1000 |    883278.09 |    883530 |     882718 |    879662 |    885513 |     883924 |           11321.46 |
     |     244 |       31 |     1000 |    883450.95 |    883366 |     881851 |    879653 |    887556 |     884622 |           11319.25 |
     |     245 |       31 |     1000 |    884341.14 |    884678 |     883217 |    881012 |    887595 |     885706 |           11307.85 |
     |     247 |       31 |     1000 |    884553.00 |    884583 |     883451 |    880453 |    888203 |     885251 |           11305.15 |
     |     255 |       32 |     1000 |    885629.04 |  885502.5 |     884491 |    882627 |    888554 |   886437.5 |           11291.41 |
     |     271 |       34 |     1000 |    890651.62 |    890170 |  889178.75 |    887641 |    898746 |   891356.5 |           11227.74 |
     |     300 |       38 |     1000 |    894793.61 |    895449 |   892636.5 |    891122 |    898087 |   896271.5 |           11175.76 |
     |     327 |       41 |     1000 |    895566.29 |    895354 |     894345 |    891602 |    901577 |     896560 |           11166.12 |
     |     344 |       44 |     1000 |    898491.66 |    898158 |     897039 |    892511 |    904225 |   899726.5 |           11129.76 |
     |     359 |       45 |     1000 |    899121.36 |  899038.5 |  898568.25 |    896221 |    901920 |   899858.5 |           11121.97 |
     |     360 |       46 |     1000 |    899560.03 |    900588 |     896437 |    893423 |    905629 |     902831 |           11116.55 |
     |     362 |       46 |     1000 |    899803.00 |    899761 |   898453.5 |    895047 |    905104 |   901035.5 |           11113.54 |
     |     364 |       46 |     1000 |    899735.00 |  899382.5 |     898493 |    894866 |    909009 |     901210 |           11114.38 |
     |     365 |       46 |     1000 |   1450150.63 |   1450157 |    1449065 |   1446424 |   1455044 |  1450824.5 |            6895.84 |
     |     366 |       46 |     1000 |   1450465.83 | 1450720.5 |    1449506 |   1446898 |   1455059 | 1451114.75 |            6894.34 |
     |     368 |       47 |     1000 |   1450443.03 |   1450354 |    1449810 |   1447446 |   1453522 |    1451166 |            6894.45 |
     |     376 |       48 |     1000 |   1451737.10 | 1452149.5 |  1450384.5 |   1447511 |   1456011 |  1452858.5 |            6888.30 |
     |     383 |       48 |     1000 |   1453486.28 | 1453211.5 | 1452741.25 |   1449406 |   1460434 | 1454567.75 |            6880.01 |
     |     399 |       50 |     1000 |   1457667.78 |   1457583 |    1456552 |   1454590 |   1462600 |    1458828 |            6860.27 |
     |     407 |       51 |     1000 |   1459878.81 |   1459755 |    1459128 |   1457074 |   1463948 |    1460798 |            6849.88 |
     |     408 |       52 |     1000 |   2133628.58 | 2133469.5 |  2132632.5 |   2126173 |   2138912 |    2134899 |            4686.85 |
     |     409 |       52 |     1000 |   2133844.02 |   2134478 | 2132234.25 |   2129214 |   2137592 | 2135061.75 |            4686.38 |
     |     411 |       52 |     1000 |   2134035.38 | 2133935.5 | 2133163.75 |   2130210 |   2136891 |    2135159 |            4685.96 |
     |     415 |       52 |     1000 |   2134848.44 | 2134744.5 | 2133389.75 |   2130847 |   2138154 |    2136323 |            4684.17 |
     |     439 |       55 |     1000 |   2142171.71 |   2141321 |    2139955 |   2136062 |   2172318 |  2142749.5 |            4668.16 |
     |     479 |       60 |     1000 |   2148670.31 |   2145915 |    2143931 |   2140288 |   2188323 |    2149047 |            4654.04 |
     |     481 |       61 |     1000 |   2150472.09 | 2145809.5 | 2144579.75 |   2140434 |   2219750 |    2148814 |            4650.14 |
     |     482 |       61 |     1000 |   2533107.21 | 2530060.5 | 2527323.75 |   2455614 |   2591087 |  2532503.5 |            3947.72 |
     |     483 |       61 |     1000 |   2533877.73 | 2529716.5 |    2527718 |   2498297 |   2588666 | 2531438.25 |            3946.52 |
     |     487 |       61 |     1000 |   2539792.18 |   2529600 | 2527748.25 |   2475207 |   3419420 | 2531257.75 |            3937.33 |
     |     495 |       62 |     1000 |   2534758.62 |   2531438 |    2529163 |   2443832 |   2583790 |  2533398.5 |            3945.15 |
     |     503 |       63 |     1000 |   2522305.17 |   2532015 |    2528636 |   2417425 |   2778622 |    2533416 |            3964.63 |
     |---------+----------+----------+--------------+-----------+------------+-----------+-----------+------------+--------------------|
     #+TBLFM: $2=(($1+8)/8);%d::$10=$3/($4/10000000);%.2f
     #+LATEX: \end{landscape}

     The knees are caused by the hardware queue getting full.  Each
     requests is of 8B size.  Each thread in the benchmark can have an
     outstanding monitor exit request (non blocking) and an
     outstanding monitor enter request (blocking).  As a result in the
     worst case scenario each thread has 16B in the monitor manager
     hardware queue.  Since the hardware queue is of 4KB size in the
     worst case scenario (where the monitor manager request handling
     rate is much lower than the requests generation rate by the
     threads) it can handle up to 256 threads.  The measurements show,
     however, that we only manage to fill the hardware queue and start
     getting NACKS only at 365 threads.

     #+begin_src gnuplot :var data=throughput :exports results :file throughput.pdf
       set style data linespoints
       set label 1 at 243,11321.46 "11321.46" center front point pt 6 ps .5 offset 0,.6
       set xlabel "Number of Java threads"
       set ylabel "Throughput (Requests/sec)"
       set xrange[0:512]
       set yrange[0:12000]
       unset key
       plot 11321.46 lc rgbcolor 'gray' dt 3, data using 1:10 ls 1 ps .5 notitle
       unset label 1
       unset xrange
       unset yrange
     #+end_src

     #+CAPTION: Impact of the number of threads\n on monitor manager throughput
     #+RESULTS:
     [[file:throughput.pdf]]

**** Monitor Manager Statistics per 1000 requests from 503 tasks with X monitor managers
     Removed outliers (at start and end of the benchmark)

     From files:
     [[file:MonitorBench_mmgrs1_d503tasks_stats.log][1 manager]], [[file:MonitorBench_mmgrs2_d503tasks_stats.log][2 manager]], [[file:MonitorBench_mmgrs3_d503tasks_stats.log][3 manager]], [[file:MonitorBench_mmgrs4_d503tasks_stats.log][4 manager]], [[file:MonitorBench_mmgrs5_d503tasks_stats.log][5 manager]], [[file:MonitorBench_mmgrs6_d503tasks_stats.log][6 manager]], [[file:MonitorBench_mmgrs7_d503tasks_stats.log][7 manager]], [[file:MonitorBench_mmgrs8_d503tasks_stats.log][8 manager]],

     #+LATEX: \begin{landscape}
     #+ATTR_LaTeX: :environment longtable
     #+tblname: single-manager-stats
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     | # Managers | Manager | Requests | mean (ticks) |    median |         q1 |     min |     max |         q3 | Throughput (Req/s) |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          1 |       1 |     1000 |   2522305.17 |   2532015 |    2528636 | 2417425 | 2778622 |    2533416 |            4136.63 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          2 |       1 |     1000 |    850957.05 |    851181 |   850472.5 |  848283 |  852900 |     851538 |           11788.52 |
     |          2 |       2 |     1000 |    917950.89 |    918001 |   917418.5 |  914964 |  919782 |     918778 |           10929.39 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          3 |       1 |     1000 |   1288808.45 |   1289372 |    1288161 | 1286554 | 1289941 |    1289615 |            7772.70 |
     |          3 |       2 |     1000 |   1281411.50 |   1281944 |    1279337 | 1275959 | 1285851 |  1283892.5 |            7837.24 |
     |          3 |       3 |     1000 |   1280792.40 | 1280427.5 |  1279583.5 | 1275470 | 1284687 | 1283406.75 |            7840.25 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          4 |       1 |     1000 |   1718250.77 |   1718244 |    1718229 | 1718208 | 1718334 |    1718253 |            5820.02 |
     |          4 |       2 |     1000 |   1704014.88 |   1703139 |    1701923 | 1699002 | 1709525 |    1706191 |            5885.81 |
     |          4 |       3 |     1000 |   1704059.88 |   1703452 |    1701499 | 1700754 | 1708759 |    1706367 |            5879.75 |
     |          4 |       4 |     1000 |   1703911.77 |   1704428 |    1703331 | 1698311 | 1708029 |    1705125 |            5888.20 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          5 |       1 |     1000 |   2164711.75 | 2159717.5 | 2159678.25 | 2159497 | 2181655 |  2164315.5 |            4630.71 |
     |          5 |       2 |     1000 |   2142601.62 |   2140324 |  2138345.5 | 2132005 | 2158709 | 2144536.25 |            4690.42 |
     |          5 |       3 |     1000 |   2142460.25 |   2141965 | 2137763.25 | 2126861 | 2161108 |  2147285.5 |            4701.76 |
     |          5 |       4 |     1000 |   2142492.87 |   2141329 |  2135208.5 | 2129847 | 2164249 | 2145703.25 |            4695.17 |
     |          5 |       5 |     1000 |   2164467.75 | 2159111.5 | 2159085.75 | 2158820 | 2185199 | 2163389.75 |            4632.16 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          6 |       1 |     1000 |      2603175 | 2602901.5 | 2602046.75 | 2600633 | 2605912 |  2604430.5 |            3845.22 |
     |          6 |       2 |     1000 |   2572666.33 |   2574878 | 2568747.25 | 2566886 | 2576529 |    2575812 |            3895.77 |
     |          6 |       3 |     1000 |   2572237.66 | 2572838.5 | 2568935.75 | 2566732 | 2577957 |  2574778.5 |            3896.00 |
     |          6 |       4 |     1000 |   2573059.16 | 2574382.5 | 2571994.75 | 2568433 | 2574899 |    2574890 |            3893.42 |
     |          6 |       5 |     1000 |   2571478.66 | 2571252.5 |    2570683 | 2569424 | 2574159 | 2572031.25 |            3891.92 |
     |          6 |       6 |     1000 |    2572023.5 | 2569803.5 |  2567519.5 | 2566399 | 2579976 |  2577001.5 |            3896.51 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          7 |       1 |     1000 |      3044055 |   3037656 | 3037089.75 | 3036141 | 3064767 | 3044621.25 |            3293.65 |
     |          7 |       2 |     1000 |   3025632.66 | 3009054.5 | 2994422.75 | 2984196 | 3149736 | 3011420.75 |            3350.99 |
     |          7 |       3 |     1000 |      3001809 |   3008138 |    2993577 | 2988854 | 3009749 |    3008727 |            3345.76 |
     |          7 |       4 |     1000 |    3002143.6 |   3006789 |    2994874 | 2989764 | 3010409 |    3008882 |            3344.75 |
     |          7 |       5 |     1000 |    3001178.2 |   3004923 |    2993289 | 2990943 | 3010603 |    3006133 |            3343.43 |
     |          7 |       6 |     1000 |    3001499.2 |   2997883 |    2994817 | 2992081 | 3012515 |    3010200 |            3342.16 |
     |          7 |       7 |     1000 |    3002925.6 |   3004878 |    2990568 | 2987140 | 3017069 |    3014973 |            3347.68 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     |          8 |       1 |     1000 |    3474222.5 |   3475535 |  3472002.5 | 3467258 | 3478562 |    3477755 |            2884.12 |
     |          8 |       2 |     1000 |      3420089 |   3422918 |    3416036 | 3409154 | 3428195 |  3425556.5 |            2933.28 |
     |          8 |       3 |     1000 |    3416276.5 |   3415823 | 3409993.75 | 3409915 | 3423545 | 3422105.75 |            2932.62 |
     |          8 |       4 |     1000 |   3416487.75 | 3415512.5 | 3414229.75 | 3413218 | 3421708 |  3417770.5 |            2929.79 |
     |          8 |       5 |     1000 |    3416248.5 | 3413128.5 | 3412750.25 | 3412619 | 3426118 | 3416626.75 |            2930.30 |
     |          8 |       6 |     1000 |    3418633.5 |   3418647 |    3416726 | 3414797 | 3422443 |  3420554.5 |            2928.43 |
     |          8 |       7 |     1000 |   3417436.75 |   3416973 | 3414596.25 | 3413049 | 3422752 |  3419813.5 |            2929.93 |
     |          8 |       8 |     1000 |    3418359.5 | 3417951.5 | 3416161.25 | 3415616 | 3421919 | 3420149.75 |            2927.73 |
     |------------+---------+----------+--------------+-----------+------------+---------+---------+------------+--------------------|
     #+TBLFM: $10=$3/($7/10000000);%.2f
     #+LATEX: \end{landscape}

     #+tblname: throughput-scale
     |------------+---------------------------|
     | # Managers | Total Throughput (Reqs/s) |
     |------------+---------------------------|
     |          1 |                   4136.63 |
     |          2 |                  22717.91 |
     |          3 |                  23450.19 |
     |          4 |                  23473.78 |
     |          5 |                  23350.22 |
     |          6 |                  23318.84 |
     |          7 |                  23368.42 |
     |          8 |                   23396.2 |
     |------------+---------------------------|

     #+begin_src gnuplot :var data=throughput-scale :exports results :file throughput_scale.pdf
       set style data linespoints
       set xlabel "Number of Managers"
       set ylabel "Throughput (Requests/sec)"
       set xrange[0.5:8.5]
       set yrange[0:24000]
       unset key
       plot data using 1:2 notitle
       unset xrange
       unset yrange
     #+end_src

     #+CAPTION: Impact of the number of monitor managers on throughput 
     #+RESULTS:
     [[file:throughput_scale.pdf]]

**** Measurements from 503 tasks with X monitor managers

     From files:
     [[file:MonitorBench_mmgrs1_d503tasks.log][1 manager]], [[file:MonitorBench_mmgrs2_d503tasks.log][2 manager]], [[file:MonitorBench_mmgrs3_d503tasks.log][3 manager]], [[file:MonitorBench_mmgrs4_d503tasks.log][4 manager]], [[file:MonitorBench_mmgrs5_d503tasks.log][5 manager]], [[file:MonitorBench_mmgrs6_d503tasks.log][6 manager]], [[file:MonitorBench_mmgrs7_d503tasks.log][7 manager]], [[file:MonitorBench_mmgrs8_d503tasks.log][8 manager]]

     #+tblname: var-managers
     |------------+------------+--------+--------+------+-------+--------|
     | # Managers |  mean (ms) | median |     q1 |  min |   max |     q3 |
     |------------+------------+--------+--------+------+-------+--------|
     |          1 | 10462.1391 |  10300 |   9823 | 8861 | 12108 |  11134 |
     |          2 |  2175.5725 |   2175 |   2175 | 2174 |  2182 |   2176 |
     |          3 |  2172.4811 |   2173 |   2172 | 2164 |  2174 |   2173 |
     |          4 |  2167.2644 |   2168 |   2162 | 2161 |  2175 | 2172.5 |
     |          5 |  2172.4174 |   2172 |   2172 | 2164 |  2174 |   2173 |
     |          6 |  2172.4532 |   2173 |   2172 | 2164 |  2174 |   2173 |
     |          7 |  2172.3916 |   2172 |   2172 | 2164 |  2174 |   2173 |
     |          8 |  2162.3001 |   2162 |   2162 | 2161 |  2164 |   2163 |
     |------------+------------+--------+--------+------+-------+--------|

     #+begin_src gnuplot :var data=var-managers :exports results :file var_mmgr.pdf
       set style data linespoints
       set xlabel "Number of Managers"
       set ylabel "Total execution time (ms per core)\n for 100 monitor enter/exit pairs"
       set xrange[0.5:8.5]
       set yrange[0:12500]
       set boxwidth .25 relative
       unset key
       plot data using 1:3, \
            data using 1:4:5:6:7 with candlesticks whiskerbars, \
            data using 1:3:3:3:3 with candlesticks lt -1 notitle
       unset xrange
       unset yrange
     #+end_src

     #+CAPTION: Impact of the number of monitor managers on performance
     #+RESULTS:
     [[file:var_mmgr.pdf]]

     A timer wrap-around (wa) is 4294967296 cc = ~429,496ms = ~7.158278827 min

* Footnotes

[fn:1] A timer wrap-around (wa) is 4294967296 cc = ~429,496ms = ~7.158278827 min
